Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyGridLines Property
 Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyGridLines { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyGridLines As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyGridLines {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace